app/controllers/top_controller.rb

  def index
    @comment = Comment.new(user_id: current_user.id)
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    @comment =Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["content", "テストです"], ["created_at", 2017-06-18 07:32:43 UTC], ["updated_at", 2017-06-18 07:32:43 UTC]]